app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
SELECT MIN("pages"."id") AS min_id FROM "pages"  WHERE (parent_id is NULL)
---
  def first_root
    page_first_root_id = (Page.where(["parent_id is NULL"])).minimum(:id)

SELECT MAX("pages"."id") AS max_id FROM "pages"
---
  def new_root
    parent_id = nil
    new_id = Page.maximum(:id) + 1

SELECT MAX("pages"."id") AS max_id FROM "pages"
---
  def new
    parent_id = @page.id
    new_id = Page.maximum(:id) + 1

INSERT INTO "pages" ("body", "created_at", "name", "parent_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @page = Page.new(page_params)
    respond_to do |format|
      if @page.save